public class Ex4Lev1 {
    public static void main(String[] args) {
        /*
         *Треугольник существует только тогда, когда сумма любых двух его
         *сторон больше третьей. Дано: a, b, c – стороны предполагаемого
         *треугольника. Напишите программу которая укажет существует такой
         *треугольник или нет.
        //Закомментировано потому что задачи без чисел. А без инициализации чисел не работает.
        *
        int a;
        int b;
        int c;

        if ((a + b) > c && (a + c) > b && (c + b) > a) {
            System.out.println("Such a triangle does not exist.");
        } else System.out.println("Lovely triangle!");
         */
    }
}
